Revit 2024 API
Group.GroupType Property
Get or set the type of the group.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public virtual GroupType GroupType { get; set; }
Visual Basic
Public Overridable Property GroupType As GroupType
	Get
	Set
Visual C++
public:
virtual property GroupType^ GroupType {
	GroupType^ get ();
	void set (GroupType^ value);
}
Remarks
By setting this property the group can be swapped to a different kind of group.
See Also
Group Class
Autodesk.Revit.DB Namespace